Netgear/wnce4004/0x42D14C/package3.raw

POST /apply.cgi HTTP/1.1
Host: example.com
Content-Type: text/xml; charset=utf-8
Content-Length: 500
SOAPAction: "http://example.com/weather:service:WANIPConnection:#SetIPInterfaceInfo"

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <getWeather xmlns="http://example.com/weather">
            <NewAddressingType>Static</NewAddressingType>
            <NewExternalIPAddress>123</NewExternalIPAddress>
            <NewSubnetMask>123</NewSubnetMask>
            <NewDefaultGateway>123</NewDefaultGateway>
        </getWeather>
    </soap:Body>
</soap:Envelope>